{
    "projects": [
        {
            "name": "Projetos/Exercícios do Curso de Computação",
            "url": "https://github.com/yLexter/Exercicios",
            "image": "https://c8.alamy.com/comp/CY2BHT/web-development-concept-in-word-tag-cloud-on-black-background-CY2BHT.jpg",
            "description": "Todos os meus exercícios e projetos da faculdade",
            "languages": [
                "Python",
                "Java",
                "C"
            ]
        },
        {
            "name": "Bot Para Discord",
            "url": "https://github.com/yLexter/botyLexter",
            "image": "https://droplr.com/wp-content/uploads/2020/09/discord-bots-1200x400.png",
            "description": "Este bot multifuncional permite a reprodução de músicas nos canais de voz do Discord, oferece recursos de administração para manter a ordem nos servidores, e inclui minigames para diversão adicional. Além disso, o bot integra-se com o MongoDB para armazenar configurações do servidor, informações de administração e estatísticas, tornando-o altamente personalizável. Configuração e personalização são simples, e o projeto é de código aberto, permitindo contribuições para melhorias contínuas.",
            "languages": [
                "NodeJs",
                "MongoDB"
            ]
        },
        {
            "name": "ToDo List (Construção)",
            "url": "https://github.com/yLexter/ToDoList",
            "image": "https://c4.wallpaperflare.com/wallpaper/461/208/984/quote-wallpaper-preview.jpg",
            "description": "Este projeto é um aplicativo da web de gerenciamento de lista de tarefas, projetado para ajudar os usuários a acompanhar suas tarefas diárias de maneira eficiente e organizada. A aplicação permite que os usuários criem, editem, excluam e marquem tarefas como concluídas, proporcionando uma experiência de gerenciamento de tarefas intuitiva e eficaz.",
            "languages": [
                "TypeScript",
                "MongoDB",
                "NextJs"
            ]
        },
        {
            "name": "WikiDarius (Construção)",
            "url": "https://wikidarius.vercel.app/",
            "image": "https://i.pinimg.com/originals/6f/93/50/6f93508f78319faf2a9929632b3fc041.jpg",
            "description": "WikiDarius é uma plataforma online dedicada a criar uma comunidade de jogadores apaixonados de League of Legends (LoL), com um foco especial no campeão Darius. Este site foi criado para reunir jogadores de Darius de todo o mundo e proporcionar um espaço onde eles possam aprender, compartilhar experiências e aprofundar seus conhecimentos sobre este temível campeão. Aqui, você encontrará uma riqueza de informações sobre Darius, desde guias e estratégias até discussões, vídeos e muito mais.",
            "languages": [
                "TypeScript",
                "MongoDB",
                "NextJs"
            ]
        }
    ]
}