{
    "name": "Lucas Maia",
    "socials": {
        "github": "https://github.com/yLexter",
        "linkedin": "https://www.linkedin.com/in/lucas-ferreira-maia-82a25b263?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
        "twitter": "https://twitter.com/yLexter1",
        "email": "lucasmaia5954@gmail.com"
    },
    "languages": {
        "pt_BR": {
            "naveBar": {
                "home": "Início",
                "aboutMe": "Sobre Mim",
                "skills": "Skills",
                "timeline": "Timeline",
                "projects": "Projetos",
                "contact": "Contato"
            },
            "sectionTitle": {
                "aboutMe": "Sobre Mim",
                "skills": "Habilidades",
                "timeline": "Linha do Tempo",
                "projects": "Projetos"
            },
            "about": {
                "presetation": "Olá, Eu sou o",
                "profession": {
                    "presetation": "Eu sou um",
                    "profession": "Desenvolvedor Web"
                },
                "resume": "Sou um entusiasta da tecnologia e desde o momento em que descobri o maravilhoso universo da programação, tenho mergulhado de cabeça em projetos e desafios.",
                "aboutMe": "Me chamo Lucas Ferreira Maia, tenho 21 anos, moro em Campina Grande - PB e desde criança sempre tive uma paixão por matemática e tecnologias que me fez entrar no curso computação na Universidade Estadual da Paraíba (UEPB) (5° Período). Atualmente estou na procura da minha primeira vaga como desenvolvedor.",
                "buttons": {
                    "cv": "Meu CV",
                    "aboutMe": "Sobre Mim"
                }
            },
            "timeline": [
                {
                    "title": "Primeiro contato com progamação",
                    "date": "05/06/2021",
                    "text": "Começei estudando Javascript e a fazer bots para dicosrd como hobbie."
                },
                {
                    "title": "Curso de Computação",
                    "date": "23/04/2022",
                    "text": "Entrei para o curso de computação para UEPB."
                },
                {
                    "title": "Área de Web",
                    "date": "15/01/2023",
                    "text": "Conheci e começei os estudos de progamação web."
                },
                {
                    "title": "Atualmente",
                    "date": "",
                    "text": "Estou no 5° Período (8 no Total) do curso de Ciências da Computação."
                }
            ],
            "skills": [
                {
                    "title": "HTML, CSS & Javascript",
                    "icons": [
                        "HTML",
                        "CSS",
                        "JavaScript"
                    ],
                    "description": "Possuo amplo conhecimento em HTML e CSS para a criação de interfaces atraentes e responsivas. No JavaScript, possuo habilidades avançadas, incluindo o domínio de tópicos avançados como Promises, async/await, e manipulação eficiente de eventos."
                },
                {
                    "title": "Next JS , Typescript & Tailwind",
                    "icons": [
                        "NextJs",
                        "TypeScript",
                        "Tailwind"
                    ],
                    "description": "Tenho experiência em desenvolvimento web com Next.js, TypeScript e Tailwind CSS, criando aplicações modernas e eficientes com rotas dinâmicas, tipagem estática e estilização rápida.   "
                },
                {
                    "title": "Python, Java & C",
                    "icons": [
                        "Python",
                        "Java",
                        "C"
                    ],
                    "description": "Em Python, domino a sintaxe e sou experiente em bibliotecas como Pandas e Matplotlib para manipulação e visualização de dados. Em Java, possuo conhecimento completo em programação orientada a objetos. Em C, tenho familiaridade com sintaxe e conceitos básicos, com ênfase na manipulação de arquivos."
                },
                {
                    "title": "Git & Github",
                    "icons": [
                        "Git",
                        "Github"
                    ],
                    "description": "Sou proficiente no uso do Git, realizando operações como pull requests e gerenciamento de branches. Tenho experiência na hospedagem de repositórios no Github e compreendo os conceitos fundamentais de controle de versão."
                },
                {
                    "title": "Mongo DB e SQL",
                    "icons": [
                        "MongoDB",
                        "Sql"
                    ],
                    "description": "Possuo habilidades em MongoDB, incluindo operações CRUD e modelagem eficiente de dados. Em SQL, tenho experiência em vários tipos de consultas, normalização e diagramas de entidade-relacionamento."
                }
            ],
            "contact": {
                "inputs": {
                    "username": {
                        "label": "Nome",
                        "placeholder": "Digite seu nome..."
                    },
                    "email": {
                        "label": "Email",
                        "placeholder": "Digite seu email..."
                    },
                    "message": {
                        "label": "Nome",
                        "placeholder": "Digite seu nome..."
                    }
                },
                "submit": "Enviar"
            },
            "projects": [
                {
                    "name": "Projetos/Exercícios",
                    "github": "https://github.com/yLexter/Exercicios",
                    "image": "images/projects/curse/main.jpeg",
                    "description": "Todas minhas Atividades/Projetos da faculdade. Em Python, aprendi a utilizar as bibliotecas Pandas e Matplotlib para manipulação e visualização de dados. Em C, explorei conceitos de baixo nível, como alocação dinâmica de memória, ponteiros e manipulação de arquivos. Em Java, aprofundei meu conhecimento em Programação Orientada a Objetos (POO) e utilizei a ferramenta JUnit para realizar testes unitários. Estudei e implementei diversas estruturas de dados, como filas, pilhas, tabelas hash, árvores vermelhas e pretas, árvores splay e árvores AVL, além de realizar análises assintóticas de algoritmos.",
                    "languages": [
                        "Python",
                        "Java",
                        "C"
                    ]
                },
                {
                    "name": "Bot Para Discord",
                    "github": "https://github.com/yLexter/BotMusica",
                    "image": "https://appmaster.io/cdn-cgi/image/width=768,quality=83,format=auto/api/_files/KQtkEi6WmzvGz7ACPAghma/download/",
                    "description": "Este bot permite a reprodução de músicas no Discord, com diversos comandos e interações através de botões de interação em mensagem.",
                    "languages": [
                        "NodeJs",
                        "MongoDB",
                        "Discord-JS"
                    ]
                },
                {
                    "name": "ToDo List (BackEnd em Construção)",
                    "github": "https://github.com/yLexter/ToDoList",
                    "image": "https://i.ibb.co/999nD3q/Screenshot-5.png",
                    "description": "Este projeto é um aplicativo da web de gerenciamento de lista de tarefas, projetado para ajudar os usuários a acompanhar suas tarefas diárias de maneira eficiente e organizada. A aplicação permite que os usuários criem, editem, excluam e marquem tarefas como concluídas",
                    "languages": [
                        "Shardcn UI",
                        "Tailwind CSS",
                        "TypeScript",
                        "MongoDB",
                        "NextJs",
                        "Next-Auth",
                        "Prisma",
                        "SQL"
                    ]
                },
                {
                    "name": "Github Profile",
                    "github": "https://github.com/yLexter/github-profile",
                    "image": "https://i.ibb.co/s1Pskg1/imagem-2024-02-24-021325493.png",
                    "description": "O projeto GitHub Profile é uma aplicação web desenvolvida com Next.js que permite buscar dados de usuários do GitHub de forma simplificada. Com esta aplicação, você pode obter informações básicas sobre um usuário do GitHub, como nome, foto de perfil, número de seguidores e repositórios públicos.",
                    "languages": [
                        "TypeScript",
                        "NextJs",
                        "Rest API",
                        "Shardcn UI",
                        "Tailwind CSS"
                    ]
                }
            ]
        },
        "en_US": {
            "naveBar": {
                "home": "Home",
                "aboutMe": "About Me",
                "skills": "Skills",
                "timeline": "Timeline",
                "projects": "Projects",
                "contact": "Contact"
            },
            "sectionTitle": {
                "aboutMe": "About Me",
                "skills": "Skills",
                "timeline": "Timeline",
                "projects": "Projects"
            },
            "about": {
                "presetation": "Hello, I am",
                "profession": {
                    "presetation": "I am a",
                    "profession": "Web Developer"
                },
                "resume": "I am passionate about technology, and since I discovered the wonderful universe of programming, I have immersed myself in projects and challenges.",
                "aboutMe": "My name is Lucas Ferreira Maia, I am 21 years old, I live in Campina Grande - PB, and since I was a child, I have always had a passion for mathematics and technologies, which led me to study Computer Science at the State University of Paraíba (UEPB) (5th Period). I am currently looking for my first job as a developer.",
                "buttons": {
                    "cv": "My CV",
                    "aboutMe": "About Me"
                }
            },
            "timeline": [
                {
                    "title": "First contact with programming",
                    "date": "05/06/2021",
                    "text": "Started studying Javascript and making bots for Discord as a hobby."
                },
                {
                    "title": "Computer Science Course",
                    "date": "23/04/2022",
                    "text": "I joined the computer science course at UEPB."
                },
                {
                    "title": "Web Development Area",
                    "date": "15/01/2023",
                    "text": "I started studying web programming."
                },
                {
                    "title": "Currently",
                    "date": "",
                    "text": "I am in the 5th Period (8 in Total) of the Computer Science course."
                }
            ],
            "skills": [
                {
                    "title": "HTML, CSS & Javascript",
                    "icons": [
                        "HTML",
                        "CSS",
                        "JavaScript"
                    ],
                    "description": "I have extensive knowledge in HTML and CSS for creating attractive and responsive interfaces. In JavaScript, I have advanced skills, including mastery of advanced topics such as Promises, async/await, and efficient event handling."
                },
                {
                    "title": "Next JS , Typescript & Tailwind",
                    "icons": [
                        "NextJs",
                        "TypeScript",
                        "Tailwind"
                    ],
                    "description": "I have experience in web development with Next.js, TypeScript, and Tailwind CSS, creating modern and efficient applications with dynamic routes, static typing, and quick styling."
                },
                {
                    "title": "Python, Java & C",
                    "icons": [
                        "Python",
                        "Java",
                        "C"
                    ],
                    "description": "In Python, I master the syntax and have experience with libraries like Pandas and Matplotlib for data manipulation and visualization. In Java, I have complete knowledge of object-oriented programming. In C, I am familiar with syntax and basic concepts, with an emphasis on file manipulation."
                },
                {
                    "title": "Git & Github",
                    "icons": [
                        "Git",
                        "Github"
                    ],
                    "description": "I am proficient in using Git, performing operations such as pull requests and branch management. I have experience in hosting repositories on Github and understand the fundamental concepts of version control."
                },
                {
                    "title": "Mongo DB and SQL",
                    "icons": [
                        "MongoDB",
                        "Sql"
                    ],
                    "description": "I have skills in MongoDB, including CRUD operations and efficient data modeling. In SQL, I have experience in various types of queries, normalization, and entity-relationship diagrams."
                }
            ],
            "contact": {
                "inputs": {
                    "username": {
                        "label": "Name",
                        "placeholder": "Enter your name..."
                    },
                    "email": {
                        "label": "Email",
                        "placeholder": "Enter your email..."
                    },
                    "message": {
                        "label": "Message",
                        "placeholder": "Enter your message..."
                    }
                },
                "submit": "Submit"
            },
            "projects": [
                {
                    "name": "Projects/Exercises",
                    "github": "https://github.com/yLexter/Exercicios",
                    "image": "images/projects/curse/main.jpeg",
                    "description": "All my activities/projects from college. In Python, I learned to use the Pandas and Matplotlib libraries for data manipulation and visualization. In C, I explored low-level concepts such as dynamic memory allocation, pointers, and file manipulation. In Java, I deepened my knowledge of Object-Oriented Programming (OOP) and used the JUnit tool for unit testing. I studied and implemented various data structures, such as queues, stacks, hash tables, red-black trees, splay trees, and AVL trees, as well as asymptotic analyses of algorithms.",
                    "languages": [
                        "Python",
                        "Java",
                        "C"
                    ]
                },
                {
                    "name": "Discord Bot",
                    "github": "https://github.com/yLexter/BotMusica",
                    "image": "https://appmaster.io/cdn-cgi/image/width=768,quality=83,format=auto/api/_files/KQtkEi6WmzvGz7ACPAghma/download/",
                    "description": "This bot allows playing music on Discord, with various commands and interactions through message interaction buttons.",
                    "languages": [
                        "NodeJs",
                        "MongoDB",
                        "Discord-JS"
                    ]
                },
                {
                    "name": "ToDo List (Backend in Construction)",
                    "github": "https://github.com/yLexter/ToDoList",
                    "image": "https://i.ibb.co/999nD3q/Screenshot-5.png",
                    "description": "This project is a web application for managing to-do lists, designed to help users track their daily tasks efficiently and organized. The application allows users to create, edit, delete, and mark tasks as completed.",
                    "languages": [
                        "Shardcn UI",
                        "Tailwind CSS",
                        "TypeScript",
                        "MongoDB",
                        "NextJs",
                        "Next-Auth",
                        "Prisma",
                        "SQL"
                    ]
                },
                {
                    "name": "Github Profile",
                    "github": "https://github.com/yLexter/github-profile",
                    "image": "https://i.ibb.co/s1Pskg1/imagem-2024-02-24-021325493.png",
                    "description": "The GitHub Profile project is a web application developed with Next.js that allows you to fetch GitHub user data in a simplified way. With this application, you can get basic information about a GitHub user, such as name, profile picture, number of followers, and public repositories.",
                    "languages": [
                        "TypeScript",
                        "NextJs",
                        "Rest API",
                        "Shardcn UI",
                        "Tailwind CSS"
                    ]
                }
            ]
        }
    }
}